about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>about</title>
<!-- 2018-02-28 Wed 10:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Kyle Cotton" />
</head>
<body>
<div id="content">
<h1 class="title">about</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. FAQ</a>
<ul>
<li><a href="#sec-1-1">1.1. How much will I need to pay?</a></li>
<li><a href="#sec-1-2">1.2. How old do i need to be?</a></li>
<li><a href="#sec-1-3">1.3. Do i have to join the RAF if I join Cadets?</a></li>
<li><a href="#sec-1-4">1.4. Can girls join?</a></li>
<li><a href="#sec-1-5">1.5. Do I have to buy the uniform?</a></li>
<li><a href="#sec-1-6">1.6. What are the rules on cosmetics and jewellery?</a></li>
<li><a href="#sec-1-7">1.7. Is it really strict?</a></li>
<li><a href="#sec-1-8">1.8. Is it all about marching?</a></li>
<li><a href="#sec-1-9">1.9. What are the rules on hair?</a></li>
<li><a href="#sec-1-10">1.10. I have a disability, can I still join?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> FAQ</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> How much will I need to pay?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
£12 per month is payed to the squadron to cover the runing costs, but activities off squadron (exlcuding camps) are free.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> How old do i need to be?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
12 and a half AND in year 8 or above
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Do i have to join the RAF if I join Cadets?</h3>
<div class="outline-text-3" id="text-1-3">
<p>
No. Cadets is all about giving teenagers the chance to learn new skills, take risks and meet new people. If you don’t want to joing the air force, thats totally fine, you don’t have too. Equally, if you want to join the RAF, joining air cadets will help you to understand the sort of life and dicipline you will be facing and what the RAF expect from you.
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Can girls join?</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The Air cadets as an organisation don’t discriminate against any race, gender or sexuality, all can join. 
</p>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Do I have to buy the uniform?</h3>
<div class="outline-text-3" id="text-1-5">
<p>
No, we provide you with most of the uniform. The only thing you have to buy are parade shoes, combat boots and a greens belt. These are not too expensive if you buy them from the right places. If you come along to a recruitment day, we will tell you the best places to buy these things.
</p>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> What are the rules on cosmetics and jewellery?</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Only discreet makeup is permitted, discreet enough so that only you should really know its there. Nail varnish must be natural colours only. Piercings are also not allowed to be worn on any Cadet activity, as well as Necklaces, chains and Bracelets.
</p>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Is it really strict?</h3>
<div class="outline-text-3" id="text-1-7">
<p>
The Air Cadets have a rank system which will require all lower ranks to obey the higher ranking cadet. Failiure to act approppriately or obey orders will result in consequences. There is a dress code which cadets are expected to follow, but generally we do not consider our squadron or the cadets as a whole to be overly strict.
</p>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Is it all about marching?</h3>
<div class="outline-text-3" id="text-1-8">
<p>
All cadets are taught to be able to correctly execute drill movements and commands. At the beginning and end of each night there are instances of drill / marching, but this is not often the focus of whole nights. Each night is something different, and there are many enjoyable activities that teens would otherwise not have access to.
</p>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> What are the rules on hair?</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Boys: Hair cannot touch your collar or ears, but as long as it fits inside your beret, it is permitted.
Girls: Hair cannot touch your collar or ears, all hair must be put into a bun and your fringe must be pinned back. You can still have long hair.
</p>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> I have a disability, can I still join?</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Absolutely! You are very welcome providing you can take part in a reasonable number of activities and as long as your disability does not cause you safety problems. Squadron staff will be happy to speak to you about this.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kyle Cotton</p>
<p class="date">Created: 2018-02-28 Wed 10:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
